JedeDChicken/Miscellaneous/Morse Code via STM32F411RE (main).c
	/*
	 * Per the hardware configuration, pressing the button causes a
	 * falling-edge event to be triggered, and a rising-edge on release.
	 * Since we are only concerned with presses, just don't trigger on
	 * releases.
	 */
	EXTI->RTSR &= ~(1 << 13);
	EXTI->FTSR |=  (1 << 13);

	/*
	 * Nothing more from the SCC, disable it to prevent accidental
	 * remapping of the interrupt lines.
	 */
	RCC->APB2ENR &= ~(1 << 14);

	////////////////////////////////////////////////////////////////////
	
	/*
	 *
	 * Per the STM32F411xC/E family datasheet, the handler for EXTI_15_10
	 * is at 40.
	 *
	 * Per the STM32F4 architecture datasheet, the NVIC IP registers
	 * each contain 4 interrupt indices; 0-3 for IPR[0], 4-7 for IPR[1],
	 * and so on. Each index has 8 bits denoting the priority in the top
	 * 4 bits; lower number = higher priority.
	 *
	 * Position 40 in the NVIC table would be at IPR[10][7:0]; or,
	 * alternatively, just IP[40].
	 */
	NVIC->IP[40] = (1 << 4);
	NVIC->IP[6]  = (0b1111 << 4);	// SysTick; make it least-priority
	
	/*
	 * Per the STM32F4 architecture datasheet, the NVIC ISER/ICER registers
	 * each contain 32 interrupt indices; 0-31 for I{S/C}ER[0], 32-63 for
	 * I{S/C}ER[1], and so on -- one bit per line.
	 *
	 * ISER is written '1' to enable a particular interrupt, while ICER is
	 * written '1' to disable the same interrupt. Writing '0' has no
	 * effect.
	 *
	 * Position 25 in the NVIC table would be at I{S/C}ER[0][25:25]; while
	 * position 27 would be at I{S/C}ER[0][27:27].
	 */
	NVIC->ISER[0] = (1 << 6);	// Note: Writing '0' is a no-op
	NVIC->ISER[1] = (1 << 8);	// Note: Writing '0' is a no-op
	EXTI->IMR |= (1 << 13);		// Unmask the interrupt on Line 13
	TIM2->EGR |= (1 << 0);		// Trigger an update on TIM2
	TIM2->CR1 |= (1 << 0);		// Activate both timers
	irq_data.pressed = 0;
	
	/*
	 * Enable tick counting; the idea is to allow main() to perform
	 * periodic tasks.
	 */
	SysTick->LOAD = (20000-1);	// Target is 100 Hz with 2MHz clock
	SysTick->VAL  = 0;
	SysTick->CTRL &= ~(1 << 2);	// Clock base = 16MHz / 8 = 2MHz
	SysTick->CTRL &= ~(1 << 16);
	SysTick->CTRL |= (0b11 << 0);	// Enable the tick
	
	// Do the initialization of USART last.
	usart2_init();
}

/////////////////////////////////////////////////////////////////////////////

/*
 * Copyright message printed upon reset
 * 
 * Displaying author information is optional; but as always, must be present
 * as comments at the top of the source file for copyright purposes.
 * 
 * FIXME: Modify this prompt message to account for additional instructions.
 */
static const char banner_msg[] =
"\033[0m\033[2J\033[1;1H"
"-------------------------------------------------------------------\r\n"
"EEE 158: Electrical and Electronics Engineering Laboratory V\r\n"
"         Academic Year 2022-2023, Semester 1\r\n"
"\r\n"
"Week 07: (Universal Synchronous/Asynchronous Receiver/Transmitter)\r\n"
"\r\n"				// [BEGIN] Author info
"Name:    <your name here>\r\n"
"Section: <your section here>\r\n"
"Date:    <date here>\r\n"	// [END] Author info
"-------------------------------------------------------------------\r\n"
"\r\n"
"Press the following keys to control the on-board LED:\r\n"
"\t- <Up>/W/w      Turn ON the LED\r\n"
"\t- <Down>/S/s    Turn OFF the LED\r\n"
"\t- <Space>       Toggle the LED; no effect while blinking\r\n"
"\t- <Left>/A/a    Dim the LED, if ON\r\n"
"\t- <Right>/D/d   Brighten the LED, if ON\r\n"
"\t- <F5>          LED blinks roughly 5x/s\r\n"
"\t- <F6>          LED blinks 2x/s\r\n"
"\t- <F7>          LED blinks 1x/2s\r\n"
"\t- <F8>          LED blinks 1x/s\r\n"
"\r\n";

/*
 * For readability reasons, the ANSI control sequences and the data string are
 * kept separate; the compiler treats these as one continuous string.
 * 
 * cbstr_0 is the message shown upon initialization. These fragments do the
 * following:
 * 	- Moves the cursor to Line 19, Column 1 ("\033[19;1H")
 * 	- Sets the color scheme to default ("\033[0m")
 * 	- Clears the contents from the cursor (inclusive) to the end of the screen ("\033[0J")
 * 	- Shows the actual message, with its own color codes if any
 * 	- Sets the color scheme to default ("\033[0m")
 * 
 * FIXME: Update "Line 19" to match the new end of the banner after additional
 *        instructions are added.
 */
static const char cbstr_0[] = "\033[23;1H\033[0m\033[0J" "Electrical" "\033[0m";
static const char cbstr_1[] = "\033[23;1H\033[41m\033[37m\033[0J" "and" "\033[41m\033[37m";
static const char cbstr_2[] = "\033[23;1H\033[42m\033[30m\033[0J" "Electronics" "\033[42m\033[30m";
static const char cbstr_3[] = "\033[23;1H\033[44m\033[37m\033[0J" "Engineering" "\033[44m\033[37m";
static const char cbstr_4[] = "\033[23;1H\033[46m\033[30m\033[0J" "Institute" "\033[46m\033[30m";
static const char cbstr_5[] = "\033[23;1H\033[45m\033[0J" "UP" "\033[45m";
static const char cbstr_6[] = "\033[23;1H\033[43m\033[0J" "Diliman" "\033[43m";

/*
 * Array of strings to show up
 * 
 * TODO: For additional messages, define a character array like cbstr_0, and
 *       add a new entry in this array describing the new string
 */
struct bstr_desc_type {
	const char *str;
	unsigned int size;
};
static const struct bstr_desc_type cbstr_desc[] = {
	{
		.str  = cbstr_0,
		.size = sizeof(cbstr_0)-1
	},
	// TODO: Add more entries here
	{
		.str  = cbstr_1,
		.size = sizeof(cbstr_1)-1
	},
	{
		.str  = cbstr_2,
		.size = sizeof(cbstr_2)-1
	},
	{
		.str  = cbstr_3,
		.size = sizeof(cbstr_3)-1
	},
	{
		.str  = cbstr_4,
		.size = sizeof(cbstr_4)-1
	},
	{
		.str  = cbstr_5,
		.size = sizeof(cbstr_5)-1
	},
	{
		.str  = cbstr_6,
		.size = sizeof(cbstr_6)-1
	}
};


// The heart of the program
int main(void)
{
	unsigned int usart_evt = 0;	// USART event, also used for scratchwork outside
	unsigned int led_brightness = 0, led_on = 0, nr_tick = 0;
	
	// Variable to avoid changing colors too frequently
	unsigned int msg_index = 0;
	
	// Buffer for transmitting data
//	char txb_data[48];
	unsigned int txb_size = 0;
	const char *txb_ptr = 0;
	
