JedeDChicken/Miscellaneous/Morse Code via STM32F411RE (main).c
	/*
	 * Buffer for storing data from the USART; necessary to properly parse
	 * ESC sequences
	 */
	char		rxb_data[64];
	unsigned int	rxb_idx  = 0;
	unsigned int	rxb_size = 0;
	
	// Configure the system
	do_sys_config();
		
	// Print the banner first
	txb_ptr  = banner_msg;
	txb_size = sizeof(banner_msg) - 1;
	for (; txb_size > 0; ++txb_ptr, --txb_size) {
		usart2_tx_send_char(*txb_ptr);
	}
	
	// Print the first message
	msg_index = 0;
	txb_ptr  = cbstr_desc[msg_index].str;
	txb_size = cbstr_desc[msg_index].size;
	for (; txb_size > 0; ++txb_ptr, --txb_size) {
		usart2_tx_send_char(*txb_ptr);
	}
	txb_ptr = 0;
	
	/*
	 * Microcontroller main()'s are expected to never return; hence, the
	 * infinite loop.
	 */
	led_brightness = 100;		// Start at dim brightness
	led_on = 0;			// LED initially OFF
	for (;;) {
		
		/////////////////////////////////////////////////////////////
		
		// Check for any data received via USART2.
		do {
			usart_evt = usart2_rx_try_get_event();
			if (usart_evt == USART_RX_EVT_NONE)
				// Nothing to do here
				break;
			
			if (usart_evt & USART_RX_EVT_ERR_MASK)
				// Data has errors; ignore
				break;
			
			/*
			 * [1] If an IDLE is detected, update the size.
			 *     
			 * [2] If no data is present, we're done.
			 */
			if (usart_evt & USART_RX_EVT_IDLE) {
				rxb_size = rxb_idx;
				break;
			} else if (!(usart_evt & USART_RX_EVT_DATA_VALID)) {
				break;
			}
			
			// Store the data
			if (rxb_idx >= sizeof(rxb_data)) {
				rxb_size = rxb_idx;
				break;
			}
			rxb_data[rxb_idx++] = usart_evt & USART_RX_EVT_DATA_MASK;
			break;
		} while (0);
		
		// Clear out any backlogs in the TX queue
		if (txb_size > 0 && txb_ptr) {
			if (usart2_tx_try_send_char(*txb_ptr)) {
				// Successfully enqueued
				--txb_size;
				++txb_ptr;
				if (txb_size == 0)
					txb_ptr = 0;
			}
		}
		
		/////////////////////////////////////////////////////////////
		
		/*
		 * Since we are operating on a per-character basis, if rxb_size
		 * is non-zero we immediately process the data.
		 */
		if (rxb_size > 0) {
			if (rxb_data[0] == 0x1B) {

/*				 * ESC sequence
				 *
				 * The rest of the buffer must be examined to
				 * determine what this code is.
				 *
				 * TODO: If applicable, place here escape
				 *       codes for most other keys, like
				 *       Alt+ESC.
				 *
				 * NOTE: The vast majority of escape sequences
				 *       sent by modern PCs follow either the
				 *       VT1xx or xterm standards.*/

/*				if (rxb_size == 3) {
					if (!memcmp(rxb_data+1, "[A", 2)) {
						// Up arrow pressed
						led_on = 1;
						key_pressed = 0;
					} else if (!memcmp(rxb_data+1, "[B", 2)) {
						// Down arrow pressed
						led_on = 0;
						key_pressed = 0;
					} else if (!memcmp(rxb_data+1, "[C", 2)) {
						// Right arrow pressed
						led_brightness = 100;
					} else if (!memcmp(rxb_data+1, "[D", 2)) {
						// Left arrow pressed
						led_brightness = 20;
					}
				}
// 				else if (rxb_size == 7 && !memcmp(rxb_data+1, "[24;3~", 6)) {
// 					// Alt+F12 pressed
// 				}
				else if (rxb_size == 5) {
					if (!memcmp(rxb_data+1, "[15~", 4)) {
						//F5
					}
					else if (!memcmp(rxb_data+1, "[17~", 4)) {
						//F6
						key_pressed = 2;
					}
					else if (!memcmp(rxb_data+1, "[18~", 4)) {
						//F7
						key_pressed = 3;
					}
					else if (!memcmp(rxb_data+1, "[19~", 4)) {
						//F8
						key_pressed = 4;
					}
				}*/
			}

			else {

/*				 * Just a plain character
				 * 
				 * TODO: If applicable, place here other
				 *       actions that use only plain
				 *       characters.*/
				if (FIFO_idx < 5) {
					switch (rxb_data[0]) {
						case 'A':
						case 'a':
							//
							FIFO[FIFO_idx] = 1;
							FIFO_idx += 1;
							break;
						case 'B':
						case 'b':
							FIFO[FIFO_idx] = 2;
							FIFO_idx += 1;
							break;
						case 'C':
						case 'c':
							FIFO[FIFO_idx] = 3;
							FIFO_idx += 1;
							break;
						case 'D':
						case 'd':
							FIFO[FIFO_idx] = 4;
							FIFO_idx += 1;
							break;
						case 'E':
						case 'e':
							FIFO[FIFO_idx] = 5;
							FIFO_idx += 1;
							break;
						case 'F':
						case 'f':
							//
							FIFO[FIFO_idx] = 6;
							FIFO_idx += 1;
							break;
						case 'G':
						case 'g':
							FIFO[FIFO_idx] = 7;
							FIFO_idx += 1;
							break;
						case 'H':
						case 'h':
							FIFO[FIFO_idx] = 8;
							FIFO_idx += 1;
							break;
						case 'I':
						case 'i':
							FIFO[FIFO_idx] = 9;
							FIFO_idx += 1;
							break;
						case 'J':
						case 'j':
							FIFO[FIFO_idx] = 10;
							FIFO_idx += 1;
							break;
						case 'K':
						case 'k':
							//
							FIFO[FIFO_idx] = 11;
							FIFO_idx += 1;
							break;
						case 'L':
						case 'l':
							FIFO[FIFO_idx] = 12;
							FIFO_idx += 1;
							break;
						case 'M':
						case 'm':
							FIFO[FIFO_idx] = 13;
							FIFO_idx += 1;
							break;
						case 'N':
						case 'n':
							FIFO[FIFO_idx] = 14;
							FIFO_idx += 1;
							break;
						case 'O':
						case 'o':
							FIFO[FIFO_idx] = 15;
							FIFO_idx += 1;
							break;
						case 'P':
						case 'p':
							//
							FIFO[FIFO_idx] = 16;
							FIFO_idx += 1;
							break;
						case 'Q':
						case 'q':
							FIFO[FIFO_idx] = 17;
							FIFO_idx += 1;
							break;
						case 'R':
						case 'r':
							FIFO[FIFO_idx] = 18;
							FIFO_idx += 1;
							break;
						case 'S':
						case 's':
							FIFO[FIFO_idx] = 19;
							FIFO_idx += 1;
							break;
						case 'T':
						case 't':
							FIFO[FIFO_idx] = 20;
							FIFO_idx += 1;
							break;
						case 'U':
						case 'u':
							//
							FIFO[FIFO_idx] = 21;
							FIFO_idx += 1;
							break;
						case 'V':
						case 'v':
							FIFO[FIFO_idx] = 22;
							FIFO_idx += 1;
							break;
						case 'W':
						case 'w':
							FIFO[FIFO_idx] = 23;
							FIFO_idx += 1;
							break;
						case 'X':
						case 'x':
							FIFO[FIFO_idx] = 24;
							FIFO_idx += 1;
							break;
						case 'Y':
						case 'y':
							FIFO[FIFO_idx] = 25;
							FIFO_idx += 1;
							break;
						case 'Z':
						case 'z':
							//
							FIFO[FIFO_idx] = 26;
							FIFO_idx += 1;
							break;

						case '1':
							FIFO[FIFO_idx] = 31;
							FIFO_idx += 1;
							break;
						case '2':
							FIFO[FIFO_idx] = 32;
							FIFO_idx += 1;
							break;
						case '3':
							FIFO[FIFO_idx] = 33;
							FIFO_idx += 1;
							break;
						case '4':
							FIFO[FIFO_idx] = 34;
							FIFO_idx += 1;
							break;
						case '5':
							//
							FIFO[FIFO_idx] = 35;
							FIFO_idx += 1;
							break;
						case '6':
							FIFO[FIFO_idx] = 36;
							FIFO_idx += 1;
							break;
						case '7':
							FIFO[FIFO_idx] = 37;
							FIFO_idx += 1;
							break;
						case '8':
							FIFO[FIFO_idx] = 38;
							FIFO_idx += 1;
							break;
						case '9':
							FIFO[FIFO_idx] = 39;
							FIFO_idx += 1;
							break;
						case '0':
							//
							FIFO[FIFO_idx] = 30;
							FIFO_idx += 1;
							break;

/*						case ' ':
							// Toggle the LED
							if ((led_on == 1) && (key_pressed == 0))
								led_on = 0;
							else if ((led_on == 0) && (key_pressed == 0))
								led_on = 1;
							break;*/
					}
				}
			}
			
			// "Clear" the buffer.
			rxb_size = rxb_idx = 0;
		}
		
/*		while (rxb_size < 5) {
			switch (rxb_data[rxb_idx]) {
				case 'A':
				case 'a':
				//
					rxb_data[rxb_idx] = 1;
					rxb_idx += 1;
					rxb_size += 1;
					break;
				case 'B':
				case 'b':
					rxb_data[rxb_idx] = 2;
					rxb_idx += 1;
					rxb_size += 1;
					break;
			}
		}*/

		/////////////////////////////////////////////////////////////
		
