JedeDChicken/Miscellaneous/Morse Code via STM32F411RE (main).c
		/*
		 * Change the brightness, as appropriate.
		 * 
		 * NOTE: We can use 'usart_evt' as a scratch variable, since
		 *       its data is no longer relevant here.
		 */
		switch (led_on) {
			case 0:
				// Solid-OFF
				TIM2->CCR1 = 0;
				break;
			case 1:
				// Solid-ON
				TIM2->CCR1 = led_brightness;
				break;
		}
		
		/////////////////////////////////////////////////////////////
		
		// Handle the pushbutton press here
		if (irq_data.pressed) {
			irq_data.pressed = 0;
			
			// [BEGIN] User code
			/*
			 * TODO: Insert action(s) to be done when the button
			 *       is pressed
			 */
			// [END] User code

/*			if (counter2 > 100) {
				if (msg_index < 6) {
					msg_index += 1;
				}
				else {
					msg_index = 0;
				}
				txb_ptr  = cbstr_desc[msg_index].str;
				txb_size = cbstr_desc[msg_index].size;
				for (; txb_size > 0; ++txb_ptr, --txb_size) {
					usart2_tx_send_char(*txb_ptr);
				}
				txb_ptr = 0;
				counter2 = 0;
			}*/
		}
		
		/////////////////////////////////////////////////////////////
		
		/*
		 * Handle periodic ticks here
		 * 
		 * Based on the configuration for SysTick in do_sys_config(),
		 * ticks occur at a nominal rate of 100 Hz. irq_data.nr_tick
		 * can be greater than one, in case some events were missed.
		 */
		if ((nr_tick = irq_data.nr_tick) > 0) {
			irq_data.nr_tick = 0;
			
			// [BEGIN] User code
			/*
			 * TODO: Any tasks periodically done nominally every
			 *       10 ms (= 1/100Hz) should be added here.
			 */
			// [END] User code

			counter2 += 1;

/*			if (FIFO_idx == 5) {
				for (int i=0; i<5; i++) {
					if(FIFO[i] == 1) {						//A
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if (counter == 50) {			//Space
							led_on = 0;
						}
						else if (counter == 100) {			//Dash
							led_on = 1;
						}
						else if (counter == 250) {			//Off
							led_on = 0;
						}
						else if (counter == 400) {
							counter = 0;
							FIFO_idx -= 1;
						}
						break;
					}
					else if (FIFO[i] == 2) {				//B
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 450)) {		//Off
							led_on = 0;
						}
						else if (counter == 600) {
							counter = 0;
							FIFO_idx -= 1;
						}
						break;
					}
				}
			}*/

			if (FIFO_idx == 5) {
				if (FIFO_idxsub > 0) {
					key_pressed = FIFO[FIFO_idx2];

					if (key_pressed == 1) {					//A
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if (counter == 50) {			//Space
							led_on = 0;
						}
						else if (counter == 100) {			//Dash
							led_on = 1;
						}
						else if (counter == 250) {			//Space
							led_on = 0;
						}
						else if (counter == 400) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 2) {			//B
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 600)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 3) {			//C
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 500)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 550)) {		//Space
							led_on = 0;
						}
						else if ((counter == 700)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 4) {			//D
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if (counter == 150) {			//Space
							led_on = 0;
						}
						else if (counter == 200) {			//Dot
							led_on = 1;
						}
						else if (counter == 250) {			//Space
							led_on = 0;
						}
						else if (counter == 300) {			//Dot
							led_on = 1;
						}
						else if (counter == 350) {			//Space
							led_on = 0;
						}
						else if (counter == 500) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 5) {			//E
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if (counter == 50) {			//Space
							led_on = 0;
						}
						else if (counter == 200) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 6) {			//F
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if ((counter == 50)) {			//Space
							led_on = 0;
						}
						else if ((counter == 100)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 600)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 7) {			//G
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if (counter == 150) {			//Space
							led_on = 0;
						}
						else if (counter == 200) {			//Dash
							led_on = 1;
						}
						else if (counter == 350) {			//Space
							led_on = 0;
						}
						else if (counter == 400) {			//Dot
							led_on = 1;
						}
						else if (counter == 450) {			//Space
							led_on = 0;
						}
						else if (counter == 600) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 8) {			//H
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if ((counter == 50)) {			//Space
							led_on = 0;
						}
						else if ((counter == 100)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 500)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 9) {			//I
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if (counter == 50) {			//Space
							led_on = 0;
						}
						else if (counter == 100) {			//Dot
							led_on = 1;
						}
						else if (counter == 150) {			//Space
							led_on = 0;
						}
						else if (counter == 300) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

