JedeDChicken/Miscellaneous/Morse Code via STM32F411RE (main).c
					else if (key_pressed == 10) {			//J
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if ((counter == 50)) {			//Space
							led_on = 0;
						}
						else if ((counter == 100)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 500)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 550)) {		//Space
							led_on = 0;
						}
						else if ((counter == 700)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 11) {			//K
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if (counter == 150) {			//Space
							led_on = 0;
						}
						else if (counter == 200) {			//Dot
							led_on = 1;
						}
						else if (counter == 250) {			//Space
							led_on = 0;
						}
						else if (counter == 300) {			//Dash
							led_on = 1;
						}
						else if (counter == 450) {			//Space
							led_on = 0;
						}
						else if (counter == 600) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 12) {			//L
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if ((counter == 50)) {			//Space
							led_on = 0;
						}
						else if ((counter == 100)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 600)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 13) {			//M
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if (counter == 150) {			//Space
							led_on = 0;
						}
						else if (counter == 200) {			//Dash
							led_on = 1;
						}
						else if (counter == 350) {			//Space
							led_on = 0;
						}
						else if (counter == 500) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 14) {			//N
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if (counter == 150) {			//Space
							led_on = 0;
						}
						else if (counter == 200) {			//Dot
							led_on = 1;
						}
						else if (counter == 250) {			//Space
							led_on = 0;
						}
						else if (counter == 400) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 15) {			//O
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if (counter == 150) {			//Space
							led_on = 0;
						}
						else if (counter == 200) {			//Dash
							led_on = 1;
						}
						else if (counter == 350) {			//Space
							led_on = 0;
						}
						else if (counter == 400) {			//Dash
							led_on = 1;
						}
						else if (counter == 550) {			//Space
							led_on = 0;
						}
						else if (counter == 700) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 16) {			//P
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if ((counter == 50)) {			//Space
							led_on = 0;
						}
						else if ((counter == 100)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 500)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 550)) {		//Space
							led_on = 0;
						}
						else if ((counter == 700)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 17) {			//Q
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 500)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 650)) {		//Space
							led_on = 0;
						}
						else if ((counter == 800)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 18) {			//R
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if (counter == 50) {			//Space
							led_on = 0;
						}
						else if (counter == 100) {			//Dash
							led_on = 1;
						}
						else if (counter == 250) {			//Space
							led_on = 0;
						}
						else if (counter == 300) {			//Dot
							led_on = 1;
						}
						else if (counter == 350) {			//Space
							led_on = 0;
						}
						else if (counter == 500) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 19) {			//S
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if (counter == 50) {			//Space
							led_on = 0;
						}
						else if (counter == 100) {			//Dot
							led_on = 1;
						}
						else if (counter == 150) {			//Space
							led_on = 0;
						}
						else if (counter == 200) {			//Dot
							led_on = 1;
						}
						else if (counter == 250) {			//Space
							led_on = 0;
						}
						else if (counter == 400) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 20) {			//T
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if (counter == 150) {			//Space
							led_on = 0;
						}
						else if (counter == 300) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 21) {			//U
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if (counter == 50) {			//Space
							led_on = 0;
						}
						else if (counter == 100) {			//Dot
							led_on = 1;
						}
						else if (counter == 150) {			//Space
							led_on = 0;
						}
						else if (counter == 200) {			//Dash
							led_on = 1;
						}
						else if (counter == 350) {			//Space
							led_on = 0;
						}
						else if (counter == 500) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 22) {			//V
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if ((counter == 50)) {			//Space
							led_on = 0;
						}
						else if ((counter == 100)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 600)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 23) {			//W
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if (counter == 50) {			//Space
							led_on = 0;
						}
						else if (counter == 100) {			//Dash
							led_on = 1;
						}
						else if (counter == 250) {			//Space
							led_on = 0;
						}
						else if (counter == 300) {			//Dash
							led_on = 1;
						}
						else if (counter == 450) {			//Space
							led_on = 0;
						}
						else if (counter == 600) {			//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 24) {			//X
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 550)) {		//Space
							led_on = 0;
						}
						else if ((counter == 700)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 25) {			//Y
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 500)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 650)) {		//Space
							led_on = 0;
						}
						else if ((counter == 800)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 26) {			//Z
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 500)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 550)) {		//Space
							led_on = 0;
						}
						else if ((counter == 700)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 31) {			//1
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if ((counter == 50)) {			//Space
							led_on = 0;
						}
						else if ((counter == 100)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 500)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 650)) {		//Space
							led_on = 0;
						}
						else if ((counter == 700)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 850)) {		//Space
							led_on = 0;
						}
						else if ((counter == 1000)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 32) {			//2
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if ((counter == 50)) {			//Space
							led_on = 0;
						}
						else if ((counter == 100)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 550)) {		//Space
							led_on = 0;
						}
						else if ((counter == 600)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 750)) {		//Space
							led_on = 0;
						}
						else if ((counter == 900)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 33) {			//3
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if ((counter == 50)) {			//Space
							led_on = 0;
						}
						else if ((counter == 100)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 500)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 650)) {		//Space
							led_on = 0;
						}
						else if ((counter == 800)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

