JedeDChicken/Miscellaneous/Morse Code via STM32F411RE (main).c
					else if (key_pressed == 34) {			//4
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if ((counter == 50)) {			//Space
							led_on = 0;
						}
						else if ((counter == 100)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 550)) {		//Space
							led_on = 0;
						}
						else if ((counter == 700)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 35) {			//5
						counter += 1;
						if (counter == 1) {					//Dot
							led_on = 1;
						}
						else if ((counter == 50)) {			//Space
							led_on = 0;
						}
						else if ((counter == 100)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 600)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 36) {			//6
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 250)) {		//Space
							led_on = 0;
						}
						else if ((counter == 300)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 500)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 550)) {		//Space
							led_on = 0;
						}
						else if ((counter == 700)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 37) {			//7
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 450)) {		//Space
							led_on = 0;
						}
						else if ((counter == 500)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 550)) {		//Space
							led_on = 0;
						}
						else if ((counter == 600)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 650)) {		//Space
							led_on = 0;
						}
						else if ((counter == 800)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 38) {			//8
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 550)) {		//Space
							led_on = 0;
						}
						else if ((counter == 600)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 650)) {		//Space
							led_on = 0;
						}
						else if ((counter == 700)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 750)) {		//Space
							led_on = 0;
						}
						else if ((counter == 900)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 39) {			//9
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 550)) {		//Space
							led_on = 0;
						}
						else if ((counter == 600)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 750)) {		//Space
							led_on = 0;
						}
						else if ((counter == 800)) {		//Dot
							led_on = 1;
						}
						else if ((counter == 850)) {		//Space
							led_on = 0;
						}
						else if ((counter == 1000)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

					else if (key_pressed == 30) {			//0
						counter += 1;
						if (counter == 1) {					//Dash
							led_on = 1;
						}
						else if ((counter == 150)) {		//Space
							led_on = 0;
						}
						else if ((counter == 200)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 350)) {		//Space
							led_on = 0;
						}
						else if ((counter == 400)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 550)) {		//Space
							led_on = 0;
						}
						else if ((counter == 600)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 750)) {		//Space
							led_on = 0;
						}
						else if ((counter == 800)) {		//Dash
							led_on = 1;
						}
						else if ((counter == 950)) {		//Space
							led_on = 0;
						}
						else if ((counter == 1100)) {		//Finish
							counter = 0;
							FIFO_idx2 += 1;
							FIFO_idxsub -= 1;
						}
					}

/*					if (finish == 1) {
						FIFO_idx2 += 1;
						FIFO_idx -= 1;
						finish = 0;
						counter = 0;
					}*/

				}

				else if (FIFO_idxsub == 0) {
					FIFO_idx = 0;
					FIFO_idx2 = 0;
					FIFO_idxsub = 5;
				}

			// "Clear" the buffer.
			// FIFO_idx2 = FIFO_idx = 0;
			// memset{FIFO, '\0', sizeof(FIFO)};

		}
	}
	}

	// This line is supposed to never be reached.
	return 1;
}
